In [1]:
import numpy as np
import pandas as pd

In [11]:
columns = ['W', 'X', 'Y', 'Z',]

In [12]:
index = ['A', 'B', 'C', 'D', 'E']

In [13]:
from numpy.random import randint

In [14]:
np.random.seed(42)
data = randint(-100,100, (5,4))

In [15]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [16]:
df = pd.DataFrame(data, index, columns)

In [17]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [18]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int32

In [19]:
df[['W', 'Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [20]:
df['new'] = df['W'] + df['Y']

In [21]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [22]:
df.drop('new', axis=1)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [23]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [24]:
df = df.drop('new', axis=1)

In [25]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [26]:
df.loc['A']

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int32

In [28]:
df.loc[['A', 'E']]

    W   X   Y   Z
A   2  79  -8 -86
E  30  49 -48 -99

In [29]:
df.iloc[0]

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int32

In [30]:
df.iloc[0:3]

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80
C  2  21 -26 -13

In [31]:
df.drop('C', axis=0)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
D  16  -1   3  51
E  30  49 -48 -99

In [32]:
df.loc['A', 'W']

2

In [33]:
df.loc[['A','C'], ['W', 'X', 'Y']]

   W   X   Y
A  2  79  -8
C  2  21 -26

In [34]:
df > 0

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True
E  True   True  False  False

In [35]:
df[df>0]

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

In [38]:
df[df['X'] > 0]

    W   X   Y   Z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

In [39]:
df[(df['W'] > 0) & (df['Y'] > 1)]

    W   X   Y   Z
B   6 -29  88 -80
D  16  -1   3  51

In [40]:
df.reset_index()

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

In [41]:
new_ind = ['CA', 'NY', 'WY', 'OR', 'CO']

In [43]:
df['States'] = new_ind

In [44]:
df

    W   X   Y   Z States
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     WY
D  16  -1   3  51     OR
E  30  49 -48 -99     CO

In [45]:
df.loc['F'] = [24,25,26,27, 'WA']

In [46]:
df

    W   X   Y   Z States
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     WY
D  16  -1   3  51     OR
E  30  49 -48 -99     CO
F  24  25  26  27     WA

In [48]:
df = df.set_index('States')

In [50]:
df

         W   X   Y   Z
States
CA       2  79  -8 -86
NY       6 -29  88 -80
WY       2  21 -26 -13
OR      16  -1   3  51
CO      30  49 -48 -99
WA      24  25  26  27

In [49]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [51]:
df.describe()

               W          X          Y          Z
count   6.000000   6.000000   6.000000   6.000000
mean   13.333333  24.000000   5.833333 -33.333333
std    11.910779  37.666962  47.473852  63.920784
min     2.000000 -29.000000 -48.000000 -99.000000
25%     3.000000   4.500000 -21.500000 -84.500000
50%    11.000000  23.000000  -2.500000 -46.500000
75%    22.000000  43.000000  20.250000  17.000000
max    30.000000  79.000000  88.000000  51.000000

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, CA to WA
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       6 non-null      int64
 1   X       6 non-null      int64
 2   Y       6 non-null      int64
 3   Z       6 non-null      int64
dtypes: int64(4)
memory usage: 240.0+ bytes

In [54]:
df.dtypes

W    int64
X    int64
Y    int64
Z    int64
dtype: object